app/Controllers/Customers.php

    public function index(): string
    {
        return view('customers', ['customers' => (new CustomerModel())->findAll()]);
---
SELECT *
FROM `customers`