app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `customers`
SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function index()
    {
        return view('home', [
            'title' => 'Dashboard',
            'customerCount' => (new CustomerModel())->countAll(),
            'userCount' => (new UserModel())->countAll(),