app/Controllers/Users.php

    public function index()
    {
        return view('users/index', [
            'title' => 'User Accounts',
            'users' => $this->users->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function edit(int $id)
    {
        $user = $this->users->find($id);
        if (! $user) {
            throw PageNotFoundException::forPageNotFound('User not found.');
        }

        if ($this->request->is('post')) {
            $rules = [
                'id' => 'required|is_natural_no_zero',
                'username' => "required|min_length[3]|max_length[50]|alpha_dash|is_unique[users.username,id,{$id}]",
                'full_name' => 'required|min_length[2]|max_length[100]',
                'email' => 'permit_empty|valid_email|max_length[120]',
            ];

            $avatar = $this->request->getFile('avatar');
            if ($avatar && $avatar->getError() !== UPLOAD_ERR_NO_FILE) {
                $rules['avatar'] = 'uploaded[avatar]|is_image[avatar]|mime_in[avatar,image/jpg,image/jpeg,image/png]|ext_in[avatar,jpg,jpeg,png]|max_size[avatar,2048]';
            }

            if (! $this->validate($rules)) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            $data = $this->userData();
            if ($avatar && $avatar->isValid() && ! $avatar->hasMoved()) {
                $data['avatar'] = $this->prepareAvatar($avatar->getRandomName(), $avatar);
                $this->removeOldAvatar($user['avatar'] ?? null);
            }

            $this->users->update($id, $data);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1
UPDATE `users` SET `username` = 'admin', `full_name` = 'Pink Admin', `email` = 'admin@example.com', `avatar` = '1790926977_44050efbdb4a5a30fd2e.png', `updated_at` = '2026-10-02 07:42:57'
WHERE `users`.`id` IN (1)