app/Controllers/Users.php

    public function index(): string
    {
        return view('users', ['users' => (new UserModel())->findAll()]);
---
SELECT *
FROM `users`