app/Controllers/Welcome.php

    public function index(): string
    {
        $today = date('Y-m-d');
        $tasks = (new TaskModel())
            ->where('task_date', $today)
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-02'
ORDER BY `id` ASC